import '../models/quiz_question.dart';

const questions = [
  QuizQuestion(
    'რისთვის გამოიყენება ინტრაკრანიალური კანულა?',
    [
      'თავის ტვინის აქტივობისთვის',
      'ზურგის ტვინის აქტივობისთვის',
      'არც ერთია სწორი',
    ],
  ),
  QuizQuestion('რომელია უკეთესი კვლევა სისხდენებისთვის?', [
    'CT',
    'MRT',
    'fMRT',
  ]),
  QuizQuestion(
    'PET კვლევა გამოიყენება?',
    [
      'ტვინის ფუნქციის სანახავად',
      'ცხოველებისთვის',
      'ადამიანის მოძრაობის სანახავად',
    ],
  ),
  QuizQuestion(
    'მაგნიტოენცეფალოგრაფია რა არის?',
    [
      'კვლევა',
      'დიზაინი',
      'ქირურგიული გზა',
    ],
  ),
  QuizQuestion(
    'ელექტროდების იმპლანტაცია მაგალითია?',
    [
      'ნეირონილი აქტივობის კვლევის',
      'გენეტიკური კვლევის',
      'ნეიროქიმიური კვლევის',
    ],
  ),
  QuizQuestion(
    'რამდენი მეთოდი არსებობს თავის ტვინის დაზიანების?',
    [
      '2',
      '3',
      '5',
    ],
  ),
  QuizQuestion(
    'DTI განმარტება არის?',
    [
      'დიფიზიური ტენზორული კვლევა',
      'სამედიცინო ტოპოგრატიული ინტერესი',
      'ორივე მათგანია სწორი',
    ],
  ),
  QuizQuestion(
    'DTI ზე რას ვხედავთ?',
    [
      'მიელინიზირებულ აქსონს',
      'დენდრიტს',
      'სისხლდენას',
    ],
  ),
  QuizQuestion(
    'რომელი კვლევაა უფრო სანდომიანი?',
    [
      'გააჩნია ვითარებას',
      'CT',
      'MRT',
    ],
  ),
  QuizQuestion(
    'რითი განსხვავდება MRI და CT?',
    [
      'CT უფრო ზედაპირულია ვიდრე MRI',
      'ორივე ერთი და იგივეა',
      'MRI უფრო მარტივია და იაფიანი',
    ],
  ),
  QuizQuestion(
    'ანატომიურად რომელ ნეკნთაშუა სივრცეში მოისმინება აორტის სარქველი?',
    [
      '2 ნეკნთაშუა პარასტერნალ',
      '5 ნეკნთაშუა ლავიწქვეშა',
      '5 ნეკნთაშუა პარასტერნალ',
    ],
  ),
  QuizQuestion(
    'რომელი სარკველია მიტრალური?',
    [
      'აორტის',
      '3 კარიანი',
      '2 კარიანი',
    ],
  ),
  QuizQuestion(
    'ყველაზე ძლიერი გულის ნაწილი არის?',
    [
      'მარცხენა პარკუჭი',
      'მარცხენა წინაგული',
      'მარჯვენა წინაგული',
    ],
  ),
  QuizQuestion(
    'წინაგულათა სივრცეს რომელიც უზრუნველყოფს გულის გაფართოებას დიდი სისხლის ნაკადისას ეწოდება?',
    [
      'ყური',
      'ძგიდე',
      'თავი',
    ],
  ),
  QuizQuestion(
    'პეპტიდის გამოკვლევა რითი ხდება?',
    [
      'იმუნოციტოქიმიური კვლევით',
      'იმუნოფლორესცენტული კვლევით',
      'არცერთით',
    ],
  ),
  QuizQuestion(
    'რომელი არ მიეკუთვნება გენეტიკურ მეთიდებს?',
    [
      'ტვინის დაზიანებები',
      'მიზნონტივი მუტაციები',
      'ტყუპების კვლევა',
    ],
  ),
  QuizQuestion(
    'მიზნობრივი მუტაცია მიეკუთვნება?',
    [
      'გენეტიკურ კვლევას',
      'მიზნობრივ კვლევას',
      'ნეიროქიმიურ კვლევას',
    ],
  ),
  QuizQuestion(
    'რას ბლოკავს ოლიგონუკლეოტიდები?',
    [
      'კოდირებული ცილების გამომუშავებას',
      'ამინომჟავების გამომუშავებას ',
      'ცხიმების გამომუშავებას',
    ],
  ),
];
